{
  "backend/main.mo": "Empty Motoko actor with no methods defined.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, related files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for numerous frontend source files.",
  "frontend/.env.example": "Example environment file specifying API keys for OpenWeatherMap and Google Maps.",
  "frontend/index.css": "Global Tailwind base/theme variable definitions for backgrounds, text, cards, and dark mode.",
  "frontend/index.html": "HTML entry point setting page title and mounting the React app.",
  "frontend/src/App.tsx": "Main React component handling client-side navigation between all pages.",
  "frontend/src/components/ContinentalMap.tsx": "Interactive SVG-based continent map with hover, selection, and optional marker rendering.",
  "frontend/src/hooks/useActor.ts": "Hook creating and refreshing a backend actor instance based on Internet Identity authentication state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Full Internet Identity auth provider and hook managing login, stored identities, and status tracking.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark ocean-themed color schemes, plus base styles and themed backgrounds.",
  "frontend/src/lib/cityDistrictDataset.ts": "Defines a dataset of major cities and districts with coordinates and includes a helper for case-insensitive, partial name lookup.",
  "frontend/src/lib/continentDataset.ts": "Provides sample environmental data for continents and a lookup function supporting direct and partial name matching.",
  "frontend/src/lib/countryStateDataset.ts": "Contains representative coordinates for major countries and US states with metadata for simple location lookup.",
  "frontend/src/lib/environmentData.ts": "Fetches environmental metrics using OpenWeather and USGS APIs, falling back to nulls and marking estimated values when data is unavailable.",
  "frontend/src/lib/fishingZoneHeuristics.ts": "Computes coral health scores and derives fish availability, cyclone risk, and flood risk from environmental metrics.",
  "frontend/src/lib/seaOceanDataset.ts": "Defines a dataset of major seas and oceans with coordinates and provides a name‑based lookup function.",
  "frontend/src/main.tsx": "Sets up the React app root with query client and Internet Identity provider.",
  "frontend/src/pages/AuthedLandingPage.tsx": "Displays a dashboard showing authenticated user identity details and logout option.",
  "frontend/src/pages/CalculatePage.tsx": "Provides a form to compute a coral health index based on environmental inputs and shows impacts and suggestions.",
  "frontend/src/pages/CommentPage.tsx": "Allows users to post, list, and delete comments associated with sea or ocean names.",
  "frontend/src/pages/FishingZonePage.tsx": "Searches for a sea, ocean, or city, fetches environmental data, computes conditions, and displays fishing-related metrics.",
  "frontend/src/pages/GoogleMapPage.tsx": "Searchable map page that looks up continents, seas, and oceans, fetches environmental data, and displays markers and details.",
  "frontend/src/pages/HomePage.tsx": "Underwater‑themed landing page with navigation buttons linking to core app pages.",
  "frontend/src/pages/LoginPage.tsx": "Simple login form with animated background and client‑side validation before triggering onLogin.",
  "frontend/src/pages/ProfilePage.tsx": "Profile settings page allowing name/DoB/gender edits and image upload, persisted in localStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, radii, animations, and enabling plugins for the project’s ocean/baby‑blue themes.",
  "project_state.json": "Project metadata describing current features, architecture, image requirements, and pending enhancements."
}