{
  "backend/main.mo": "Empty Motoko actor with no methods defined.",
  "feature_evidence.json": "Feature evidence report listing implemented UI and search enhancements along with affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing pre-generated summaries of various frontend source files for reference.",
  "frontend/.env.example": "Example environment variable file defining placeholder API keys for OpenWeatherMap and Google Maps.",
  "frontend/index.css": "Tailwind base and component layers defining extensive CSS variable theming for light and dark modes.",
  "frontend/index.html": "HTML entry point configuring the root element and loading the main React application script.",
  "frontend/src/App.tsx": "Main React component handling client-side navigation between app pages using local state.",
  "frontend/src/components/ContinentalMap.tsx": "Interactive world map component with SVG continent hit‑zones, hover/selection styling, and red marker projection.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and refreshes a backend actor instance based on the current authenticated identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication provider and hook managing Internet Identity login, stored identities, and status handling.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light/dark ocean themes plus global base styles.",
  "frontend/src/lib/cityDistrictDataset.ts": "Provides a dataset of major cities and districts with coordinates and a helper for fuzzy name lookup.",
  "frontend/src/lib/continentDataset.ts": "Contains sample environmental metrics for continents and a lookup function for matching by name.",
  "frontend/src/lib/countryStateDataset.ts": "Lists countries and US states with coordinates for location search and mapping.",
  "frontend/src/lib/environmentData.ts": "Fetches temperature from OpenWeather and water-quality metrics from USGS, assembling normalized environment data.",
  "frontend/src/lib/fishingZoneHeuristics.ts": "Implements heuristic scoring for coral health and generates fish availability and hazard risk descriptions.",
  "frontend/src/lib/seaOceanDataset.ts": "Defines a sea and ocean dataset with coordinates and a lookup function supporting case-insensitive and partial name matching.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AuthedLandingPage.tsx": "Displays authenticated user info from Internet Identity and shows a dashboard-style landing page.",
  "frontend/src/pages/CalculatePage.tsx": "Provides a form to input water parameters and computes a coral health index with impacts and suggestions.",
  "frontend/src/pages/CommentPage.tsx": "Implements a form for posting ocean-related comments and manages an in-memory comment list with deletion.",
  "frontend/src/pages/FishingZonePage.tsx": "Searches seas, oceans, or locations, fetches environmental data, computes heuristics, and displays fishing-zone insights.",
  "frontend/src/pages/GoogleMapPage.tsx": "Provides a search-driven map page that locates continents or seas/oceans, fetches environmental data, and updates markers and displayed metrics.",
  "frontend/src/pages/HomePage.tsx": "Renders the main baby‑blue themed homepage with navigation buttons to other app sections.",
  "frontend/src/pages/LoginPage.tsx": "Displays a styled login form with basic client-side validation and triggers onLogin without real authentication.",
  "frontend/src/pages/ProfilePage.tsx": "Implements a profile settings form with image upload, localStorage persistence, and editable personal data fields.",
  "frontend/tailwind.config.js": "Configures Tailwind with extended colors, animations, and theme settings, including custom ocean and baby‑blue palettes.",
  "project_state.json": "Stores meta-information about the project’s structure, features, themes, and architectural notes for build planning."
}