{
  "backend/main.mo": "Empty Motoko actor placeholder with no implemented methods.",
  "feature_evidence.json": "Feature evidence report linking two UI enhancements to HomePage.tsx with associated components and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend file’s purpose, including pages, components, utilities, and config.",
  "frontend/.env.example": "Example environment variables for OpenWeatherMap and Google Maps API keys.",
  "frontend/index.css": "Tailwind base stylesheet defining underwater-themed design tokens and global CSS variables.",
  "frontend/index.html": "HTML entry point setting up the root div and loading main.tsx.",
  "frontend/src/App.tsx": "Main React component controlling navigation between login, home, and feature pages using state.",
  "frontend/src/components/ContinentalMap.tsx": "Interactive SVG-based continent map with hover, selection, and optional marker rendering.",
  "frontend/src/hooks/useActor.ts": "React Query hook creating and refreshing a backend actor based on Internet Identity authentication.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity login, logout, and stored identity loading.",
  "frontend/src/index.css": "Underwater-themed global stylesheet defining updated OKLCH color tokens for light and dark modes.",
  "frontend/src/lib/continentDataset.ts": "Defines continent-level environmental sample data and provides a helper to find continents by name with direct and partial matching.",
  "frontend/src/lib/countryStateDataset.ts": "Contains a dataset of major countries and US states with coordinates and metadata for lookup.",
  "frontend/src/lib/environmentData.ts": "Provides utilities to fetch environmental metrics from OpenWeather and USGS, assembling temperature and water quality data into a unified structure.",
  "frontend/src/lib/seaOceanDataset.ts": "Defines major sea and ocean locations with coordinates and includes a search helper with normalized and partial matching.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with Internet Identity and React Query providers.",
  "frontend/src/pages/AuthedLandingPage.tsx": "Displays authenticated user info using Internet Identity, showing principal details and account status within styled UI components.",
  "frontend/src/pages/CalculatePage.tsx": "Implements a coral health index calculator using user‑provided environmental metrics and outputs condition, impacts, and suggestions.",
  "frontend/src/pages/CommentPage.tsx": "A comment page allowing users to submit ocean-related thoughts, store them locally in state, and delete entries.",
  "frontend/src/pages/GoogleMapPage.tsx": "A map search page that locates continents or seas, fetches environmental data, and displays markers and details based on user queries.",
  "frontend/src/pages/HomePage.tsx": "The main landing page with navigation buttons and hero content guiding users to different features.",
  "frontend/src/pages/LoginPage.tsx": "A login screen with styled UI that validates email/password locally and triggers navigation on success.",
  "frontend/src/pages/ProfilePage.tsx": "A profile settings page allowing users to edit personal data, upload an image, and save it to localStorage.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, plugin imports, and extensive color/theme extensions including an underwater palette.",
  "project_state.json": "Project metadata describing an ICP app with Motoko backend, React/Vite/Tailwind frontend, Internet Identity auth, UI setup, and generated assets."
}