{
  "kind": "build_request",
  "title": "Switch Home + Fishing Zone pages to baby-blue theme and remove yellow map pointer",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-14",
      "text": "Update the Home page UI styling from the current ocean/dark underwater theme classes/tokens to the existing baby-blue theme (colors, gradients, typography, cards, and buttons), while keeping the current Home page layout, content, and top navigation behavior unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "dont change this code can u change the underwater theme of home page and fishing page into baby blue theme."
        ]
      },
      "acceptanceCriteria": [
        "Home page continues to render the same sections, feature boxes, and navigation actions as before.",
        "Home page styling uses the baby-blue theme look (consistent with existing baby-blue variables/classes), not the ocean-* dark theme styling.",
        "No routing or navigation behavior changes on the Home page."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Extend Fishing Zone search to include states (in addition to seas, oceans, cities, and districts) and show the matched entity type label accordingly.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "in fishing zone page if i search any places like city ,state ,district ,seas and ocean"
        ]
      },
      "acceptanceCriteria": [
        "Searching for a known state name returns a result and displays the entity type as \"State\" in the results.",
        "Existing searches for seas, oceans, cities, and districts continue to work.",
        "If the search term is not recognized, the error message mentions all supported types: sea, ocean, city, district, and state."
      ]
    },
    {
      "id": "REQ-16",
      "text": "In Fishing Zone, highlight the searched location on the map using a red marker only for all supported search types (sea, ocean, city, district, state), and remove the yellow fish hotspot pointer behavior from the Fishing Zone experience.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "it should be hightlighted in the map using red color and remove the yellow pointer ."
        ]
      },
      "acceptanceCriteria": [
        "After a successful search, exactly one marker is shown on the Fishing Zone map: the red marker at the searched location’s coordinates.",
        "No yellow marker (fish hotspot pointer) is displayed anywhere in the Fishing Zone page/map UI.",
        "The Fishing Zone map subtitle/description text does not mention a yellow/fish hotspot marker."
      ]
    }
  ],
  "constraints": [
    "Do not modify frontend files under the immutable paths listed in SYSTEM_CONTEXT.",
    "Keep changes tightly scoped to theme/styling and the Fishing Zone search + map marker behavior; avoid unrelated refactors (user requested: \"dont change this code\").",
    "Do not introduce new backend services/canisters; implement using existing frontend datasets and components."
  ],
  "nonGoals": [
    "Adding real-time updates or live tracking on the map.",
    "Adding new external map providers or APIs beyond what is already present.",
    "Changing backend schema or adding backend methods (backend is currently unused for these features)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}