{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Apply baby-blue theme to Home + improve Fishing Zone search and marker behavior",
  "requirements": [
    {
      "id": "REQ-14",
      "summary": "Switch Home page styling from ocean/dark underwater tokens to the existing baby-blue theme while keeping layout/content/navigation unchanged",
      "acceptanceCriteria": [
        "Home page continues to render the same sections, feature boxes, and navigation actions as before.",
        "Home page styling uses the baby-blue theme look (consistent with existing baby-blue variables/classes), not the ocean-* dark theme styling.",
        "No routing or navigation behavior changes on the Home page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Replace ocean-* themed Tailwind classes with baby-blue theme classes/tokens for header, hero text, cards, buttons, and footer while preserving the existing JSX structure, content, and onNavigate behavior. Continue using existing shadcn-ui Button/Card components for consistent styling; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update the Home background styling class (.coral-reef-home-bg and its overlay) to use baby-blue theme variables (e.g., --baby-blue-*) instead of ocean-* so the Home page background/gradient matches the existing baby-blue theme without changing layout."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Extend Fishing Zone search to recognize states and display the matched entity type as \"State\"",
      "acceptanceCriteria": [
        "Searching for a known state name returns a result and displays the entity type as \"State\" in the results.",
        "Existing searches for seas, oceans, cities, and districts continue to work.",
        "If the search term is not recognized, the error message mentions all supported types: sea, ocean, city, district, and state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/FishingZonePage.tsx",
          "operation": "modify",
          "description": "Integrate state lookup into the existing search flow (alongside seas/oceans and cities/districts), expand the SearchResult.locationType union to include 'State', and ensure the displayed Badge label shows \"State\" for matches. Update validation/unknown-location error strings to mention sea, ocean, city, district, and state. Continue using existing shadcn-ui Input/Badge/Alert components for consistent UI; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/lib/countryStateDataset.ts",
          "operation": "modify",
          "description": "Add (or expose via a small helper) a state-only lookup capability that returns a match only when the dataset item type is 'state', so Fishing Zone can search states without unintentionally treating countries as valid matches."
        }
      ]
    },
    {
      "id": "REQ-16",
      "summary": "Show only a single red marker for the searched location in Fishing Zone and remove all yellow fish hotspot pointer behavior and references",
      "acceptanceCriteria": [
        "After a successful search, exactly one marker is shown on the Fishing Zone map: the red marker at the searched location’s coordinates.",
        "No yellow marker (fish hotspot pointer) is displayed anywhere in the Fishing Zone page/map UI.",
        "The Fishing Zone map subtitle/description text does not mention a yellow/fish hotspot marker."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/FishingZonePage.tsx",
          "operation": "modify",
          "description": "Remove fishHotspot computation/storage from the search result, ensure the map description/subtitle never references a yellow/fish hotspot marker, and pass only the searched location marker to the map for all supported types (sea, ocean, city, district, state)."
        },
        {
          "path": "frontend/src/components/ContinentalMap.tsx",
          "operation": "modify",
          "description": "Remove the yellow fish hotspot marker rendering logic (and related prop) so the component can render only the red marker when provided. Keep existing interaction behavior intact for other consumers, and adjust props/types accordingly."
        }
      ]
    }
  ]
}